{
  "job_title": "Internship",
  "job_description": "Work with a dynamic startup team, gain hands-on experience, and build your portfolio!",
  "company_name": "FoundrFlow",
  "location": "Remote/Hybrid",
  "experience_required": null,
  "tech_stack": [],
  "contact_info": [],
  "score": 5,
  "tier": "low",
  "tags": [
    "high_learning",
    "startup",
    "remote"
  ]
},
{
  "job_title": "Internship",
  "job_description": "2-month internship openings at FoundrFlow, a youth-led startup community.  Domains Available: Graphic Designing, Outreach & Publicity, Content Writing, Content Creation, Business Development. Work with a dynamic startup team, gain hands-on experience, and build your portfolio!",
  "company_name": "FoundrFlow",
  "location": "Remote/Hybrid",
  "experience_required": "Intern/Fresher",
  "tech_stack": [],
  "contact_info": [],
  "score": 7,
  "tier": "medium",
  "tags": [
    "unpaid",
    "student_friendly",
    "high_learning",
    "startup",
    "remote",
    "clear_info"
  ]
},
{
  "job_title": "Internship",
  "job_description": "2-month internship openings at FoundrFlow, a youth-led startup community backed by Tathagat Kumar (Startup India & Canada Punjab Mentor). Domains Available: Graphic Designing, Outreach & Publicity, Content Writing, Content Creation, Business Development. Work with a dynamic startup team, gain hands-on experience, and build your portfolio! Remote/Hybrid. Perks: Internship Certificate + Letter of Recommendation (LOR)",
  "company_name": "FoundrFlow",
  "location": "Remote/Hybrid",
  "experience_required": "Intern",
  "tech_stack": [
    "Graphic Design",
    "Content Writing",
    "Social Media Marketing",
    "Video Editing",
    "Business Development"
  ],
  "contact_info": [
    "https://forms.gle/LFwb3iSTP33N4Qh56"
  ],
  "score": 7,
  "tier": "medium",
  "tags": [
    "unpaid",
    "student_friendly",
    "high_learning",
    "startup",
    "remote",
    "clear_info"
  ]
},
{
  "job_title": "AI Engineer",
  "job_description": "Looking for AI Engineers with skills in ML and NLP to work on a business dashboard LLM. Project Duration - 3 Months",
  "company_name": null,
  "location": null,
  "experience_required": null,
  "tech_stack": [
    "Machine Learning (ML)",
    "Natural Language Processing (NLP)",
    "Large Language Models (LLM)"
  ],
  "contact_info": [
    "9501691205",
    "ayushpateriya2754@gmail.com"
  ],
  "score": 8,
  "tier": "medium",
  "tags": [
    "negotiable",
    "student_friendly",
    "high_learning",
    "clear_info"
  ]
},
{
  "job_title": "App Developer",
  "job_description": "Build MVP from scratch in 2 months. Work on real product launch. India’s Auto-Rickshaw Ride-Hailing App for Tier 2 & Tier 3 Cities.",
  "company_name": "ECTO",
  "location": "Remote",
  "experience_required": "Final-year students or recent grads preferred",
  "tech_stack": [
    "Flutter",
    "React Native",
    "Firebase",
    "Node.js"
  ],
  "contact_info": [
    "singla.manan117@gmail.com",
    "+91 93500 30763"
  ],
  "score": 8,
  "tier": "medium",
  "tags": [
    "paid",
    "student_friendly",
    "high_learning",
    "remote",
    "clear_info"
  ]
},
{
  "job_title": null,
  "job_description": null,
  "company_name": null,
  "location": null,
  "experience_required": null,
  "tech_stack": [],
  "contact_info": [],
  "score": 0,
  "tier": "low",
  "tags": [
    "clear_info"
  ]
},
{
  "job_title": null,
  "job_description": null,
  "company_name": null,
  "location": null,
  "experience_required": null,
  "tech_stack": [],
  "contact_info": [],
  "score": 0,
  "tier": "low",
  "tags": [
    "clear_info"
  ]
},
{
  "job_title": "AI/ML Intern",
  "job_description": "AI/ML Intern (Full Time - Paid Internship) Location: Remote. Experience: 0-1 year. Start Date: Immediate / As per availability. Stipend: Competitive. About SolvusAI: SolvusAI is a fast-growing AI consulting and solutioning firm helping global enterprises unlock the power of Generative AI and Machine Learning to solve real business problems. We work across industries to deliver high-impact AI strategies, advisory, and implementation solutions that create tangible value. At SolvusAI, we value curiosity, ownership, and adaptability. Whether it's through rapid prototyping, cloud-native architectures, or cutting-edge LLMs, we believe in moving fast and building smart. Join us, and be part of a collaborative, future-focused team that’s redefining what AI can do for the enterprise. Are you driven by curiosity and a passion for AI, Gen-AI, and data-driven innovation? Do you want to work at the forefront of AI development - building intelligent agents, optimizing scalable workflows, and applying cutting-edge models to real-world challenges? Key Responsibilities: Design and implement scalable, maintainable, and robust AI/ML systems. Build and fine-tune ML/DL models using core concepts like feature engineering, model evaluation, and architecture selection (e.g., CNNs, Transformers) to solve business problems. Work on agentic workflows and intelligent orchestration of LLMs using tools like LangChain or Semantic Kernel. Design and deploy RESTful APIs for AI services and intelligent pipelines. Integrate and evaluate vector databases (e.g., FAISS, Chroma, Pinecone) with LLMs for RAG-based systems. Validate and monitor AI models through rigorous testing (unit, integration, adversarial) ensuring generalization and fairness. Identify and mitigate risks related to bias, drift, and hallucinations in generative models. Deploy solutions to cloud environments (AWS, Azure, GCP) using CI/CD principles. Collaborate closely with cross-functional teams to translate business needs into AI-first solutions. Must-Have Skills & Qualifications: Bachelor's degree in engineering/technology. Final year engineering students with relevant skillsets and bandwidth can also apply. 0-1 year of industry experience in AI/ML development. Strong programming skills in Python, with experience in FastAPI. Good understanding of core ML/DL concepts: supervised/unsupervised learning, overfitting, regularization, CNNs, Transformers, etc. Experience with SQL and basic data engineering principles. Familiarity with foundational Gen-AI concepts (e.g., embeddings, prompting, fine-tuning) and models (ChatGPT, LLaMA 2/3, Mistral, Claude, etc.). Exposure to frameworks like LangChain or LlamaIndex. Understanding of agent-based workflows and AI task automation. Analytical mindset and strong debugging/problem-solving skills. Good communication and collaboration abilities in a remote work environment. Preferred Skills: Knowledge of RLHF, prompt engineering, few-shot learning. Experience with data labelling, evaluation frameworks, and synthetic data generation. Understanding of monitoring tools for model performance, latency, and observability. Working knowledge of cloud deployments and containerization (Docker, basic Kubernetes is a plus). Why Join SolvusAI? Work at the cutting edge of applied AI and Gen-AI. Collaborate with a high-energy, impact-driven team. Flexible remote environment. Ownership and visibility across projects from day one. Opportunity to shape the future of intelligent automation. How to Apply: Send us your resume and a short note on why you're interested in this role to careers@solvusai.com after applying on LinkedIn.",
  "company_name": "SolvusAI",
  "location": "India",
  "experience_required": "0-1 year",
  "tech_stack": [
    "Python",
    "FastAPI",
    "SQL",
    "LangChain",
    "LlamaIndex",
    "CNNs",
    "Transformers",
    "LLMs",
    "AWS",
    "Azure",
    "GCP",
    "Docker",
    "Kubernetes",
    "RESTful APIs",
    "Vector Databases (FAISS, Chroma, Pinecone)"
  ],
  "contact_info": [
    "careers@solvusai.com"
  ],
  "score": 12,
  "tier": "high",
  "tags": [
    "well_paid",
    "student_friendly",
    "high_learning",
    "remote",
    "full_time",
    "clear_info"
  ]
},
{
  "job_title": "App Developer Intern",
  "job_description": "Build MVP from scratch in 2 months. Work on real product launch. India’s Auto-Rickshaw Ride-Hailing App for Tier 2 & Tier 3 Cities.",
  "company_name": "ECTO",
  "location": "Remote",
  "experience_required": "Final-year students or recent grads preferred",
  "tech_stack": [
    "Flutter",
    "React Native",
    "Firebase",
    "Node.js"
  ],
  "contact_info": [
    "singla.manan117@gmail.com",
    "+91 93500 30763"
  ],
  "score": 9,
  "tier": "medium",
  "tags": [
    "paid",
    "student_friendly",
    "high_learning",
    "remote",
    "clear_info"
  ]
},
{
  "job_title": "AI/ML Intern",
  "job_description": "AI/ML Intern (Remote) – AgentCrafters.ai.  Internship with potential for a full-time offer.  Work on prototyping, testing, and deploying ML workflows; training and evaluating classical ML models; building simple NLP/computer vision applications; supporting development of AI agents using tools like OpenAI, LangChain, and other LLM frameworks; performing data preprocessing, feature engineering, and model tuning; documenting experiments and contributing to the product's intelligence layer.  Remote-first internship with flexible hours, real-world projects, fast-track to a full-time role, 1-on-1 mentorship, letter of recommendation & internship certificate.",
  "company_name": "AgentCrafters.ai (A Tungsten Technologies Venture)",
  "location": "Remote",
  "experience_required": "Freshers / Early Career",
  "tech_stack": [
    "Python",
    "NumPy",
    "Pandas",
    "Scikit-learn",
    "Matplotlib",
    "TensorFlow",
    "PyTorch",
    "OpenAI",
    "LangChain",
    "Git",
    "GitHub",
    "Bitbucket"
  ],
  "contact_info": [
    "Admin@agentcrafters.ai",
    "+91 73476 79317"
  ],
  "score": 12,
  "tier": "high",
  "tags": [
    "student_friendly",
    "high_learning",
    "remote",
    "well_paid",
    "clear_info",
    "full_time"
  ]
},
